Revit 2015 API
BaseImportOptions.GetRefPoint Method
 Gets the 3D point in the document where the imported instance will be inserted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
public XYZ GetRefPoint()
Visual Basic
Public Function GetRefPoint As XYZ
Visual C++
public:
XYZ^ GetRefPoint()
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace